export const corpEventData = () => {
  return useState("corpEventData", () => {
    return {
      title: "Корпоративные мероприятия",
      poster: "/images/posters/corp.jpg",
      content: [
        {
          type: "textBlock",
          text: `Мы рады предложить вам широкий выбор залов для проведения ваших мероприятий. Независимо от того, планируете ли вы деловую встречу, конференцию или любое другое торжество, у нас найдется идеальное пространство для вашего события. Наши залы оборудованы всем необходимым для комфортного и успешного проведения мероприятий, а наша команда профессионалов всегда готова помочь вам с организацией и обеспечением всех ваших потребностей.\n\nОзнакомьтесь с нашими залами ниже и найдите тот, который идеально подойдет для вашего мероприятия. Мы уверены, что ваше событие пройдет на высшем уровне в одном из наших прекрасных залов.`,
        },
        {
          type: "textAndPic",
          title: 'Зал "Линтулла"',
          subtitle: `Вместимость on 20 до 100+ персон`,
          text: `Внесезонный банкетный зал «Линтула» — это современное пространство для любого мероприятия: свадьбы, юбилея, корпоратива или семейного торжества. Красивое деревянное здание на живописном берегу лесного озера, панорамное остекление фасадной части зала, каскадная терраса, спускающаяся к озеру, все необходимое оборудование и уникальная дружеская атмосфера — мы подумали обо всех деталях и создали идеальную локацию для праздника!`,
          images: ["/images/halls/lintulla.jpg"],
          buttons: [{ label: "Подробнее", to: "/" }],
        },
        {
          type: "textAndPic",
          title: 'Летний шатер "Вереск"',
          subtitle: `Вместимость от 20 до 100 персон  
 Шатер открыт с июня по сентябрь. `,
          text: `Это идеальная локация для вашего корпоратива. Просторный зал с видом на озеро, окруженный хвойным лесом, выделенные зоны для банкета и фуршета, панорамная терраса для проведения тимбилдингов, природные декорации и удобный спуск к живописному озеру — здесь все создано для того, чтоб сделать ваш праздник незабываемым.`,
          images: ["/images/halls/veresk.jpg"],
          buttons: [{ label: "Подробнее", to: "/" }],
        },
        { type: "space" },
        {
          type: "textBlock",
          title: "Размещение",
          text: `Эко-парк «Вереск» — это идеальное место для проведения корпоративных праздников и мероприятий. Кроме вместительных банкетных площадок на территори распологается отель, гостевые дачи и глемпинг. Необязателно возвращаться в город после бурного веселья, оставайтесь и воспользуйтесь всеми прелестями СПА-Курорта, `,
        },
        {
          type: "offers",
          offers: [
            {
              title: "Рестораны",
              src: "/icon/banquet.png",
              link: "/restorants",
            },
            {
              title: "Спорт",
              src: "/icon/sport.png",
              link: "https://sport.veresk.club",
            },
            { title: "СПА", src: "/icon/spa.png", link: "/spa-resort" },
          ],
        },
        { type: "space" },
        // {
        //   type: "slideShow",
        //   slideShow: [
        //     { src: "/images/wedding/slides/wedding-1.jpeg" },
        //     { src: "/images/wedding/slides/wedding-2.jpeg" },
        //     { src: "/images/wedding/slides/wedding-3.jpeg" },
        //     { src: "/images/wedding/slides/wedding-4.jpeg" },
        //     { src: "/images/wedding/slides/wedding-5.jpeg" },
        //     { src: "/images/wedding/slides/wedding-6.jpeg" },
        //     { src: "/images/wedding/slides/wedding-7.jpeg" },
        //     { src: "/images/wedding/slides/wedding-8.jpeg" },
        //   ],
        // },
        {
          type: "textBlock",
          text: `Мы сделаем Ваш праздник незабываемым`,
        },
      ],
    };
  });
};
