export const faqData = () => {
  return useState("faqData", () => {
    return {
      title: "Вопросы и Ответы",
      poster: "/images/posters/veresk-for-kids.jpg",
      // subtitle: `Вход в парк бесплатный. Время работы парка — ежедневно с 10:00 до 22:00`,
      content: [
        {
          type: ["occupation"],
          q: "Какое оснащение кухни в домиках?",
          a: `В  Дачах обустроен уютный кухонный уголок с чайной станцией и капсульной кофемашиной  
Мойка — есть в наличии только в Дачах первой линии.  
В Апартаментах, Хюгге доме предусмотрены полноценные кухни.  

Если вам понадобится дополнительное оборудование, мы с радостью предоставим по вашему запросу: 
- Микроволновую печь
- Индукционную плиту и посуду
- Шампуры (в апартаментах и Хюгге они уже есть в наличии)
Также для наших маленьких гостей (до 4 лет) мы подготовим манеж или стульчик для кормления. Просто сообщите нам об этом заранее!
`,
        },
        {
          type: ["occupation"],
          q: "Какая максимальная вместимость гостей в домиках?",
          a: `В дачах, апартаментах, хюгге доме предполагается двухместное размещение, с возможностью установить доп. места.
Маскисмальная вместимость до 4 гостей.`,
        },
        {
          type: ["occupation"],
          q: "Какие документы необходимы при заселении?",
          a: `При заселении необходимо обязательно предоставить паспорта ВСЕХ
проживающих гостей и свидетельства о рождении детей.

Также возможно заселение по Госуслугам`,
        },
        {
          type: ["occupation", "restorant"],
          q: "Есть ли скидка для именниников?",
          a: `Для именниников действует скидка.
Скидка действует в сам день рождения, 3 дня до и 3 дня после.
Дання скидка не суммируется с другими акциями и спецпредложениями.`,
        },
        {
          type: ["occupation"],
          q: "Есть ли услуга раннего заселения?",
          a: `Да, раннее заселение возможно. Стоимость раннего заселения равна стоимости 1 суток размещения.
Необходимо предварительно связаться с отделом бронирования для согласования.`,
        },
        {
          type: ["pool"],
          q: "Есть ли в бассейне сеансы только для взрослых?",
          a: `Да, последний сеанс с 21:00 до 22:00`,
        },
        {
          type: ["pool"],
          q: "Сколько по времени длится сеанс в бассейне?",
          a: `Сеанс длится 2 часа`,
        },
        {
          type: ["occupation"],
          q: "Как производится уборка номеров?",
          a: `Уборка номеров происходит по запросу. Просьба обратится на ресепшен отеля`,
        },
        {
          type: ["occupation"],
          q: "Есть ли в номерах косметические принадлежности?",
          a: `Для вашего комфорта в каждом номере предусмотрены:  
- В диспенсерах: профессиональный шампунь, кондиционер, гель для душа и мыло.
-  Индивидуальные наборы: зубной, косметический (ватные диски/палочки) и шапочка для душа.

По запросу (бесплатно) также предоставляются:  
- Бритвенный набор, швейный набор и расческа.`,
        },
        {
          type: ["occupation", "pool"],
          q: "Включено ли посещение бассейна в стоимость проживания?",
          a: `По будням для проживающих гостей посещение бассейна бесплатное 1 раз в день по предварительной записи.  
В выходные и праздничные дни стоимость посещения можно уточнить у администратора или ресепшен`,
        },
        {
          type: ["occupation"],
          q: "Включен ли завтрак  в стоимость проживания?",
          a: `Завтрак включен в стоимость проживания в формате шведского стола.`,
        },
        {
          type: ["occupation"],
          q: "Есть ли уголь и розжиг в продаже?",
          a: `В продаже имеется уголь и розжиг,  стоимость можно уточнить на ресепшен или позвонить по телефону [+7 (812) 760-51-70](tel:+78127605170)`,
        },
        {
          type: ["occupation"],
          q: "Есть ли шампура в продаже?",
          a: `Шампура предоставляются бесплатно, по запросу.  
Дополнительно, в продаже имеется решётка для мангала (стоимость 1 200 руб.)`,
        },
        {
          type: ["occupation"],
          q: "Где можно пожарить мясо?",
          a: `На берегу озера есть отдельная мангальная зона (она находится рядом с часовней), так же у апартаментов, у Хьюгге дома и Лесных Лоджей есть свои мангалы`,
        },
        {
          type: ["occupation"],
          q: "Прохладно ли в Лоджах летом?",
          a: `Летом мы снимаем утеплитель и меняем на лёгкий палаточный материал с антимаскитной сеткой`,
        },
        {
          type: ["occupation"],
          q: "Холодно ли в Лоджах зимой?",
          a: `Наш Глэмпинг является всесезонным`,
        },
        {
          type: ["restorant"],
          q: "Режим работы ресторана Вереск?",
          a: `Будние дни с 12.00 до 22.30; Выходные дни с 12.00 до 23.00 (кухня работает до 22.00)`,
        },
        {
          type: ["occupation"],
          q: "Можно ли парковать машину около Дач?",
          a: `Нет. Парковки у Дач нет, возможно припарковать машину у Банкетного зала (300 метров)`,
        },
        {
          type: ["occupation", "for-kids"],
          q: "Платный ли Детский клуб?",
          a: `Посещение Детского клуба - бесплатно для проживающих гостей.`,
        },
        {
          type: ["occupation", "for-kids"],
          q: "Со скольки лет можно оставить ребёнка с аниматором?",
          a: `от 6-ти лет`,
        },
        {
          type: ["spa", "pool"],
          q: "Какая температура сауны в бассейне?",
          a: `70-80 градусов`,
        },
        {
          type: ["occupation", "for-kids"],
          q: "Расписание детского клуба?",
          a: `Ежедневно с 11.00 до 19.00`,
        },
        {
          type: ["spa", "gym", "pool"],
          q: "Можно ли воспользоваться тренажёрным залом, не посещая бассейн?",
          a: `Можно, бесплатно для проживающих гостей`,
        },
        {
          type: ["spa", "pool"],
          q: "Есть ли детский бассейн?",
          a: `Детского бассейна нет. Есть отдельная купель с гидромассажем, температурой 32 градуса`,
        },
        {
          type: ["pool"],
          q: "Какая глубина, длина, температура бассейна?",
          a: `от 1,3 метра до 3,5 м, длина 25 метров, 28 градусов вода.`,
        },
        {
          type: ["pool", "spa", "occupation"],
          q: "Можно ли лить воду на камни в сауне (бассейна и номерах)?",
          a: `Нет. У нас сухие сауны`,
        },
        {
          type: ["pool", "spa"],
          q: "Есть ли хаммам?",
          a: `Нет`,
        },
        {
          type: ["gym", "spa", "occupation"],
          q: "Есть ли тренажёрный зал?",
          a: `Есть зал для занятия фитнесом (есть только гантельный ряд и беговая дорожка)`,
        },
        {
          type: ["pool", "spa"],
          q: "Нужно ли брать халат, шапочку и тапочки в бассейн?",
          a: `Одноразовые тапочки и полотенце выдаются. Халат и шапочку можно взять с собой по желанию.`,
        },
        {
          type: ["pool", "spa"],
          q: "Режим работы бассейна?",
          a: `10 до 22 (в бассейн необходима предварительная запись)`,
        },
        {
          type: ["restorant"],
          q: "Нужно ли заранее бронировать столик в ресторане Вереск?",
          a: "Да, в ресторане Версек необходима предварительная бронь столика",
        },
        {
          type: ["occupation", "pool"],
          q: "Нужно ли предварительно записываться в бассейн?",
          a: "Да, для посещения бассейна необходима предварительная запись.",
        },
        {
          type: ["occupation", "pool"],
          q: "Размещение с питомцем, правила проживания?",
          a: `**Где возможно размещение с питомцами?**

- **Дачи, апартаменты и хюгге-дом:** допускается проживание с маленькими собаками до 8 кг.
- **Глемпинг:** возможно проживание с более крупными породами собак, за исключением бойцовских пород.
- **Отель:** проживание с домашними питомцами запрещено.

**Другие виды домашних животных**
Проживание с кошками и другими видами домашних животных (грызунами, птицами и т.п.) невозможно.  

**Стоимость проживания с питомцем**  
Стоимость — 5 000 рублей за сутки.`,
        },
        {
          type: ["occupation", "restorant"],
          q: "Где проходят завтраки?",
          a: 'Завтраки проходят в здание отеля с 08.30 до 11.00 в формате "Шведского стола"',
        },
        {
          type: ["occupation"],
          q: "Время заезда и выезда",
          a: "Заезд в 17.00, выезд до 14.00",
        },
      ],
    };
  });
};
