export const forKidsData = () => {
  return useState("forKidsData", () => {
    return {
      title: "Вереск для детей",
      poster: "/images/posters/veresk-for-kids.jpg",
      subtitle: `Вход в парк бесплатный. Время работы парка — ежедневно с 10:00 до 22:00`,
      content: [
        {
          type: "textBlock",
          text: `### Детская анимация и «лесной олень»: время незабываемых открытий
На загородном спа-курорте «Вереск» дети находят для себя настоящую страну чудес и приключений. Каждый день здесь превращается в праздник благодаря работе опытных аниматоров и уникальному дневному спортивному кэмпу «Лесной Олень».

### Мир веселой анимации
Погрузитесь в атмосферу творчества и игр, где каждый ребенок сможет открыть для себя что-то новое:  
`,
        },
        {
          type: "textBlock",
          text: `**Творческие мастер-классы:** От лепки фигурок до создания уникальных поделок, наши аниматоры не только развлекут детей, но и помогут им раскрыть свои творческие таланты.  
**Активные игры:** Независимо от погоды дети смогут участвовать в увлекательных играх — будь то квесты в лесу или весёлые соревнования в специально оборудованных игровых комнатах.  
**Открытые площадки:** В солнечные дни аниматоры организуют забавы на свежем воздухе, превращая обычные прогулки в увлекательные приключения.  
`,
        },
        {
          type: "textBlock",
          title: '"Лесной олень": спортивные достижения на природе',
          text: `Дневной детский кэмп «Лесной Олень» приглашает детей от 7 до 14 лет открывать для себя мир спорта и активного отдыха во время каникул.`,
        },
        {
          type: "textAndPic",
          title: false,
          images: ["/images/for-kids/logo-lesnoy-olen.jpg"],
          text: `- **Разнообразие видов спорта:** В кэмпе ребята могут попробовать свои силы в теннисе, паделе, плавании и других видах спорта, развивая навыки и укрепляя здоровье.
 - **Профессиональные тренеры:** Команда квалифицированных тренеров обеспечивает погружение в спорт через игровые методы, что делает обучение увлекательным и мотивирующим.
 - **Здоровый режим дня:** Каждый день начинается с утренней зарядки, после которой следуют насыщенные тренировки и полезные перерывы, где дети получают полноценное питание.`,
          buttons: [
            { label: "Подробнее о лагере", to: "https://camp.veresk.club" },
          ],
        },
        {
          type: "textBlock",
          title: "Детский день рождения",
          text: `Все мы знаем, как это сложно и трудоемко — организовать детский день рождения дома: декор, подарки, еда и стол, активности и игры. А результат классический — дети веселятся, родители и соседи в шоке, квартира вверх дном..

Мы в «Вереске» секрет идеального детского праздника разгадали давно: нужны свежий воздух, вкусная еда и много места!
Наши банкетные залы отлично подойдут для мероприятия любого масштаба: и для уютных семейных посиделок в компании близких друзей именинника, и для оравы ребятишек, прыгающих вокруг аниматора.

У нас есть ТРИ разноплановые площадки для детского торжества, чтобы получился идеальный праздник: ресторан «Вереск», всесезонный банкетный зал «Линтула» и большой летний шатер. Места хватит для всех: и для взрослых, и для малышей, и даже для их задорных игр! Просторные террасы на свежем воздухе в окружении великолепной природы станут отличной локацией для конкурсов или фото-зоны!`,
        },
        {
          type: "slideShow",
          slideShow: [
            { src: "/images/for-kids/slides/for-kids-1.jpg" },
            { src: "/images/for-kids/slides/for-kids-2.jpg" },
            { src: "/images/for-kids/slides/for-kids-3.jpg" },
            { src: "/images/for-kids/slides/for-kids-4.jpg" },
            { src: "/images/for-kids/slides/for-kids-5.jpg" },
            { src: "/images/for-kids/slides/for-kids-6.jpg" },
            { src: "/images/for-kids/slides/for-kids-7.jpg" },
            { src: "/images/for-kids/slides/for-kids-8.jpg" },
            { src: "/images/for-kids/slides/for-kids-9.jpg" },
          ],
        },
        {
          type: "textBlock",
          title: "Вкусняшки!",
          text: `У нас есть детское меню – замечательные повара с удовольствием приготовят для малышей вкусную и полезную еду. Ведь аппетит на свежем воздухе всегда отменный! Блюда для детского меню мы выбирали особенно тщательно, ведь прекрасно знаем, что наши юные гости — самые придирчивые гурманы! В специальном меню вы найдете вкусные и полезные блюда и десерты, которые точно придутся по вкусу малышам.`,
        },

        {
          type: "textBlock",
          text: `Выберите для своих детей отдых, который подарит им новые навыки и незабываемые впечатления. Курорт «Вереск» ждет своих маленьких гостей, чтобы подарить радость и новые открытия каждый день. Ваша забота о семейном досуге и развитии детей — наш приоритет!`,
        },
      ],
    };
  });
};
