export const spaData = () => {
  return useState("spaData", () => {
    return {
      title: "СПА Комплекс",
      poster: "/images/posters/spa.jpg",
      content: [
        {
          type: "textBlock",
          text: ` Бассейн в «ВерескОтеле» — больше, чем бассейн. Атриум с панорамным остеклением, хвойные кроны на расстоянии вытянутой руки и мерцающие блики на воде — здесь вы чувствуете не стены, а простор. Плывёте — и кажется, что скользите сквозь лес: сосны за стеклом сменяют друг друга, дыхание становится глубже, мысли — спокойнее. Это место, где тело и природа двигаются в одном ритме. `,
        },
        {
          type: "textAndPic",
          title: "Бассейн",
          subtitle: `Eжедневно с **10:00** до **22:00** кроме субботы и санитарных дней\n\n
Бесплатно для проживающих в будни ПН-ПТ  
Дети до 5 лет Бесплатно  
Взрослые - **3000р**, Дети от 6 до 13 лет - **1500р**\n`,
          working: `Ежедневно с 10:00 до 22:00 кроме субботы и санитарных дней`,
          params: `- Бесплатно для проживающих в будни ПН-ПТ
- Дети до 5 лет Бесплатно
- Взрослые - 3000р, Дети от 6 до 13 лет - 1500р`,
          features: ["sauna", "hydromassage", "jacuzzi"],
          text: `- атриумный зал с высоким светом и панорамными окнами на сосновый лес
- ощущение свободы и внутренней гармонии: будто плывёте не по воде, а через лесной пейзаж`,
          images: ["/images/spa/spa.jpg"],
          buttons: [{ label: "Рассписание сеансов", to: "/" }],
        },
        {
          type: "textAndPic",
          title: "Инфинити Бассейн",
          subtitle: `Eжедневно с **10:00** до **22:00** \n\n`,
          working: `Ежедневно с 10:00 до 22:00`,
          features: ["hydromassage", "jacuzzi"],
          text: `- атриумный зал с высоким светом и панорамными окнами на сосновый лес
- ощущение свободы и внутренней гармонии: будто плывёте не по воде, а через лесной пейзаж
- тишина, свет и вода — идеальный триптих для медитативного плавания или мягкой тренировки`,
          images: ["/images/spa/infinity.jpg"],
        },
        { type: "space" },
        {
          type: "textBlock",
          title: "СПА-центр,  ВерескОтеля",
          text: `Гордость ВерескОтеля СПА-центр, который расположен в отдельном пространстве, граничащeм с бассейном.  Это территория отдыха и расслабления всем телом и душой. 
С целью оздоровления и профилактики заболеваний Вы можете посетить сеанс общеоздоровительного СПА-массажа. Такой массаж способен придать бодрость, поднять настроение и общий жизненный тонус. Это прекрасное средство снятия усталости и напряжения.`,
        },
        {
          type: "buttons",
          buttons: [
            { label: "Подобрать процедуру или массаж", to: "/" },
            { label: "Спа туры", to: "/" },
          ],
        },
        {
          type: "slideShow",
          slideShow: [
            { src: "/images/spa/slides/spa-1.jpeg" },
            { src: "/images/spa/slides/spa-2.jpeg" },
            { src: "/images/spa/slides/spa-3.jpeg" },
            { src: "/images/spa/slides/spa-4.jpeg" },
            { src: "/images/spa/slides/spa-5.jpeg" },
            { src: "/images/spa/slides/spa-6.jpeg" },
            // { src: "/images/spa/slides/spa-7.jpeg" },
            // { src: "/images/spa/slides/spa-8.jpeg" },
          ],
        },
        {
          type: "textBlock",
          text: `Совсем рядом в нашем эко-парке расположена действующая часовня Иннокентия Иркутского, где всегда можно провести церемонию венчания.\n\n
Открывающиеся виды на песчаный берег озера «Красавица», просторные террасы, сосновый лес и умопомрачительные закаты — лучшей фото-зоны для молодоженов и гостей праздника не придумать!\n\n
Оба банкетных зала находятся на удалении друг от друга, так что ваш праздник получится именно таким, как вы задумали: ярким, счастливым и незабываемым!\n\n `,
        },
      ],
    };
  });
};
