export const sibiryakovData = () => {
	return useState("sibiryakovData", () => {
		return {
			title: "СПА-отель «Сибиряковъ»",
			slug: "sibiryakov",
			params: {
				rooms: "90",
				description:
					"Наслаждайтесь видами на лес и озеро, не выходя из номера.",
			},
			images: ["/images/occupation/veresk/standart/standart-1.jpg"],
			tl: { room: 329453, hotel: 53273 },
			vr: vereskStandartVR(),
			info: {
				price: 19800,
				link: "/hotel/standart",
				bookLink: "/",
				type: "veresk",
				description: `Отель расположен на первой береговой линии — до пляжа рукой подать. Каждый вечер гостей ждут потрясающие закаты над озером. Здесь легко забыть о суете и просто наслаждаться моментом. Это по‑настоящему прекрасное место для перезагрузки.`,
			},
			slideShow: [
				{ src: "/images/occupation/sibiryakov/sibiryakov_card.jpg" },
				{ src: "/images/occupation/sibiryakov/sibiryakov-hall-1.jpg" },
				{ src: "/images/occupation/sibiryakov/sibiryakov-hall-2.jpg" },
			],
			content: [
				{
					type: "textBlock",
					text: `Название «Сибиряковъ» не случайно. Оно отсылает к купеческому роду Сибиряковых — людям, чьи имена стали синонимом масштаба, силы и созидания. На месте будущего отеля, когда‑то стоял дом мецената Иннокентия Сибирякова — человека, для которого успех был не самоцелью, а возможностью менять мир вокруг. Эта историческая преемственность — не декоративный штрих, а смысло- вой фундамент проекта: «Сибиряковъ» продолжает традицию больших дел, но в новом формате — через создание пространства, где гость может восстановить силы, обрести внутренний баланс и почувствовать вкус жизни.  

Ассоциация с Сибирью здесь тоже не случайна: это про силу, простор, основательность. Для гостей из восточных регионов России такое звучание особенно близко — оно говорит о масштабе, надёжности и уважении к традици- ям. А для всех остальных «Сибиряковъ» становится местом, где можно ощутить эту «северную» собранность: тишину, которая лечит, и уют, который согревает.`,
				},
			],
		};
	});
};
