<template>
  <div class="tabs">
    <ContentRoomAdditionalTabItem
      v-for="(item, index) in tabs"
      :data="item"
      :key="index"
      @open="item.open = !item.open"
    />
  </div>
</template>

<script setup>
const tabs = ref([
  {
    title: "Финаносовые уcловия",
    open: false,
    description: `Указанный тариф действует за номер за ночь и включает НДС и сервисный сбор. Туристический налог включен в стоимость`,
  },
  {
    title: "Условия проживания и отмены брони",
    open: false,
    description: `В случае поступления запроса на отмену брони после 15:00 с вас будет удержана полная стоимость проживания`,
  },
  {
    title: "Услуги",
    open: false,
    description: `- Румсервис, доставка еды в номер
- Одно бесплатное посещение бассейна
- Во всех номерах и люксах предоставляется бесплатный Wi-Fi.
- Завтрак предлагается в качестве дополнительной услуги. Он подается с 8:00 до 11:00 в ресторане "Примавера" или непосредственно в номере.
- Консьерж сервис работает для Вас **круглосуточно**`,
  },
]);
</script>

<style scoped>
.tabs {
}
</style>
