export const deerData = () => {
	return useState("deerData", () => {
		return {
			title: 'Ресторан "Веранда"',
			poster: "/images/posters/restorants.jpg",
			content: [
				{
					type: "textAndPic",
					title: "Атмосфера и интерьер",
					text: `Интерьер ресторана выполнен в стиле современного шале с элементами эко-люкса. В оформлении использованы натуральный массив дуба, дикий камень и панорамное остекление, которое стирает границы между залом и живописным лесным пейзажем.  
- Панорамная терраса: Просторная веранда с видом на зеркальное озеро, где летом приятно наслаждаться утренней прохладой, а осенью — укутаться в кашемировый плед у костра.
- Живая природа: Дизайн деликатно подчеркивает тему названия: светильники из аутентичных оленьих рогов, мягкие текстуры и приглушенные землистые тона.
`,
					images: ["/images/restorants/deer/hall.jpg"],
				},
				{
					type: "textAndPic",
					title: "Гастрономическая концепция",
					text: `Меню ресторана «Олень» — это авторское прочтение современной лесной и европейской кухни от шеф-повара. Каждый рецепт разработан с учетом принципов здорового, но невероятно вкусного питания, что идеально дополняет спа-программу отеля. \n\n
- **Локальные специалитеты:** Блюда из дичи (фирменное филе оленя с брусничным соусом и кедровыми орехами), карельская форель, дикорастущие грибы и ягоды, собранные в экологически чистых районах.,
- **Wellness & Spa меню:** Специальный сбалансированный раздел для гостей, проходящих детокс-программы, включающий легкие супы-пюре, ферментированные продукты и безглютеновые позиции.`,
					images: ["/images/restorants/veresk/chief.jpg"],
				},
				{
					type: "slideShow",
					slideShow: [
						{ src: "/images/restorants/deer/slides/deer-1.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-2.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-4.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-5.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-3.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-6.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-7.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-8.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-9.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-10.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-12.jpeg" },
						{ src: "/images/restorants/deer/slides/deer-11.jpeg" },
					],
				},
				{
					type: "textBlock",
					text: `Уникальная энотека ресторана насчитывает более 300 наименований вин — от редких биодинамических образцов до признанной мировой классики Бордо и Тосканы. Профессиональный сомелье поможет подобрать идеальный аккомпанемент к блюдам из дичи. В барной карте представлены авторские коктейли на основе натуральных экстрактов, ягодных кордиалов и лечебных травяных сборов.\n\n
Профессиональный и чуткий сервис премиального уровня обеспечивает абсолютную приватность и комфорт. Здесь нет суеты: время замедляется, позволяя гостям полностью погрузиться в атмосферу гедонизма, спокойствия и природной гармонии.\n\n
`,
				},
			],
		};
	});
};
