export const aquapartyUBasseina = () => {
  return useState("aquapartyUBasseina", () => {
    return {
      title: "Аквапати на терассе у нового бассейна",
      poster: "/images/posters/aquaparty-u-basseina.jpg",
      images: ["/images/posters/aquaparty-u-basseina.jpg"],
      event_date: { d: "2026-06-20", t: "14:00" },
      post_date: { d: "2026-06-16", t: "19:00" },
      description:
        "Дневная party в субботу 20.06 на терассе открытого бассейна! Dj-сет, бар, аквазумба, конкурсы — скучно не будет!",
      content: [
        {
          type: "textBlock",
          text: `Друзья, готовьтесь к самому яркому событию этой недели!  
Приглашаем вас на аквапати у открытого круглогодичного бассейна СПА‑курорта «Вереск».  
 
Неважно, какая погода за пределами курорта — у нас будет жарко! Температура воды в бассейне стабильно держится на уровне +30 °C, так что можно смело купаться, загорать и заряжаться позитивом.`,
        },
        {
          type: "textAndPic",
          title: "Что вас ждет:",
          text: `- **Загар и купание** — удобные шезлонги, теплая вода и атмосфера праздника.
- **Зажигательный диджей** — лучшие летние хиты для отличного настроения!
- **Бар с освежающими напитками** — коктейли, лимонады и многое другое.
- **Аквазумба** — энергичная тренировка в воде для всех уровней подготовки.
- **Конкурсы в воде** — активность, смех и море веселья!`,
          images: ["/images/events/aquaparty/aquaparty-1.jpg"],
        },
        { type: "space" },
        {
          type: "eventSchedule",
          title: "Программа мероприятия",
          data: [
            { time: "14:00", text: "Музыальные  DJ-сет у бассейна" },
            { time: "16:00", text: "Загар и купание" },
            { time: "18:00", text: "Аквазумба" },
            { time: "19:00", text: "Конкурсы на воде" },
            { time: "21:00", text: "Разжигаем костер и поем песни" },
          ],
        },
        {
          type: "textAndPic",
          title: "Вход в зону бассейна",
          text: `Сообщаем, что вход в зону бассейна доступен только  для проживающих гостей курорта. Мы приняли это решение, чтобы обеспечить максимальный комфорт во время отдыха, атмосферу уединения и отсутствие переполненности;`,
          images: ["/images/events/aquaparty/aquaparty-1.jpg"],
        },
        { type: "space" },
        {
          type: "slideShow",
          slideShow: [
            { src: "/images/spa/infinity/slide-aquaparty-1.jpeg" },
            { src: "/images/spa/infinity/slide-aquaparty-2.jpeg" },
            { src: "/images/spa/infinity/slide-aquaparty-3.jpeg" },
          ],
        },
        {
          type: "textBlock",
          text: "Загорайте, купайтесь, танцуйте и веселитесь с нами!  До встречи у бассейна!",
        },
      ],
    };
  });
};
