export const concertUVody = () => {
  return useState("concertUVody", () => {
    return {
      title: "«Концерт у воды» Сергей Рогожин и Марина Цхай",
      poster: "/images/events/concert-u-vody/concert.jpg",
      images: ["/images/events/concert-u-vody/concert.jpg"],
      event_date: { d: "2026-07-01", t: "18:00" },
      post_date: { d: "2026-06-16", t: "19:00" },
      description:
        "Голоса Заслуженных артистов России Сергея Рогожина и Марины Цхай прозвучат для вас на открытой сцене СПА-курорта «Вереск». Это шанс услышать концерт вживую — такие моменты бывают редко!",
      content: [
        {
          type: "textBlock",
          text: `Голоса Заслуженных артистов России прозвучат для вас на открытой сцене СПА-курорта «Вереск».`,
        },
        {
          type: "textAndPic",
          title: "Что вас ждет:",
          text: `**Сергей Рогожин** — виртуоз, его исполнение романсов и классических произведений — это диалог с душой каждого слушателя.  

**Марина Цхай** — непревзойдённая вокалистка, голос, покоривший миллионы. 

Это шанс услышать концерт вживую — такие моменты бывают редко! `,
          images: ["/images/events/concert-u-vody/concert-3.jpg"],
        },
        {
          type: "textAndPic",
          title: false,
          text: `А если после насыщенного, наполненного музыкой и впечатлениями вечера вам не захочется уезжать — позвольтесебе продлить волшебство! Останьтесь на ночь в одном из наших уютных домиков, где каждая деталь создана для вашего комфорта.  

Представьте: следующее утро начинается с ароматного горячего кофе на просторной веранде. Вокруг — тишина, пение птиц и свежий воздух, наполненный запахами леса. Вы никуда не торопитесь — только вы, умиротворение и красота природы вокруг.
`,
          images: ["/images/events/concert-u-vody/concert-2.jpg"],
        },
        // { type: "space" },
        // {
        //   type: "slideShow",
        //   slideShow: [
        //     { src: "/images/spa/infinity/slide-aquaparty-1.jpeg" },
        //     { src: "/images/spa/infinity/slide-aquaparty-2.jpeg" },
        //     { src: "/images/spa/infinity/slide-aquaparty-3.jpeg" },
        //   ],
        // },
        {
          type: "textBlock",
          text: "Ждём вас на концерте — и пусть этот вечер станет началом чудесных воспоминаний!",
        },
      ],
    };
  });
};
